# 1. Создать новый проект
# 2. (МОДУЛЬ 1) В проекте создать новый модуль variables.py
# 3. Выбрать объект для описания из списка: овощ, еда, сотрудник, игрушка (так же можно придумать свой)
# 4. Объявить переменные основных типов данных для описания этого объекта:
#
# Например объект школьник:
# имя (тип строка), возраст (тип целое число), класс (тип целое число),
# отличник или нет (логический тип), средняя оценка (число с плавающей точкой)
#
# Чем больше переменных (характеристик), тем лучше.
# Минимально 4 переменные для типов (строка, число, число с плавающей точкой, логический тип)
#
# 5. В конце модуля с помощью функции type вывести тип для каждой из объявленных переменных
#_____________________________________________________________________________________________________

# Object - "Employee"
name = "John"
surname = "Snow"
age = 25
is_male = True
height = 1.8
place_of_birth = {"Tower of Joy"}
birth_name = "Aegon Targaryen", ""
year_of_birth = ["281 AC"]
children = None

print(type(name))
print(type(surname))
print(type(age))
print(type(is_male))
print(type(height))
print(type(place_of_birth))
print(type(birth_name))
print(type(year_of_birth))
print(type(children))


